# ExportSTEP

```pascal
FUNCTION ExportSTEP(
				filePath               : DYNARRAY[] of CHAR;
				exportSolidsAsSurfaces : BOOLEAN): BOOLEAN;
```

```python
def vs.ExportSTEP(filePath, exportSolidsAsSurfaces):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|filePath|DYNARRAY[] of CHAR|   |
|exportSolidsAsSurfaces|BOOLEAN|   |

## Version
Availability: from Vectorworks 2018

## Category
* File I@O